uhnp/src/Documents/ПоступлениеМСФО/ПоступлениеМСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеМСФО</name>
  <basedOn>Document.ОплатаМСФО</basedOn>
  <registerRecords>AccumulationRegister.ДвижениеИнвестиций</registerRecords>
  <registerRecords>InformationRegister.СтатусыОбъектовИнвестирования</registerRecords>
  <registerRecords>InformationRegister.ПоследовательностиУчастия</registerRecords>
  <registerRecords>AccountingRegister.МСФО</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>CatalogRef.ВидыОперацийУчетаМСФО</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>НДСВключенВСтоимость</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыУчетаВзаиморасчетов</name>
    <type>
      <types>CatalogRef.ПараметрыОбъектовУчетаМСФО</types>
    </type>
  </attributes>
  <attributes>
    <name>КратностьВзаиморасчетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсВзаиморасчетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>DefinedType.ТипЦенНоменклатуры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Позиции</name>
    <attributes>
      <name>Актив</name>
      <type>
        <types>DefinedType.АктивМСФО</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНалоговМСФО</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрыУчета</name>
      <type>
        <types>CatalogRef.ПараметрыОбъектовУчетаМСФО</types>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрыАмортизации</name>
      <type>
        <types>CatalogRef.ПараметрыАмортизацииВНАМСФО</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДоп</name>
      <type>
        <types>DefinedType.ДоляВладенияНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтношениеКГруппе</name>
      <type>
        <types>CatalogRef.ГруппыКонтрагентов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/Documents/ПоступлениеМСФО/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();		
	КонецЕсли;
    УправлениеФормой(ЭтаФорма);
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ПодготовитьФормуНаСервере(ТекущийОбъект);
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПодготовитьФормуНаСервере(ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_СчетФактураВыданный"
		И ТипЗнч(Параметр) = Тип("Структура") 
		И Параметр.Свойство("ДокументыОснования") 
		И Параметр.ДокументыОснования.Найти(Объект.Ссылка) <> Неопределено Тогда
		
		МСФОКлиентСерверУХ.ЗаполнитьПоСчетФактуре(ЭтотОбъект, Параметр.РеквизитыСФ);
		УправлениеФормой(ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область БСП

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ПриИзмененииРеквизита(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура СценарийПриИзменении(Элемент)
	ПриИзмененииРеквизита(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ПриИзмененииРеквизита(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	ПриИзмененииРеквизита(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ПриИзмененииРеквизита(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаПриИзменении(Элемент)
	ПриИзмененииРеквизита(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ТипЦенПриИзменении(Элемент)
	ПриИзмененииРеквизита(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ВыписатьСчетФактуру(Команда)
	
	МСФОКлиентУХ.ВыписатьСчетФактуру(ЭтотОбъект, Команда);
	
	УправлениеФормой(ЭтотОбъект);
	
	Оповестить("Запись_СчетФактураМСФО");

КонецПроцедуры

&НаКлиенте
Процедура НадписьСчетФактураНажатие(Элемент, СтандартнаяОбработка)
	МСФОКлиентУХ.ОткрытьСчетФактуруМСФО(ЭтотОбъект, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура НДСВключенВСтоимостьПриИзменении(Элемент)

	Действия = ОбработкаТабличныхЧастейКлиентСерверУХ.ПолучитьДействияПозиций(Ложь, Истина, Ложь, Ложь);
	Для каждого СтрокаТЧ Из Объект.Позиции Цикл
		ОбработатьСтрокуТЧ(ЭтотОбъект, СтрокаТЧ, Действия, Ложь);
	КонецЦикла;
	
	УправлениеФормой(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура КратностьВзаиморасчетовПриИзменении(Элемент)
	УправлениеФормой(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура КурсВзаиморасчетовПриИзменении(Элемент)
	УправлениеФормой(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыУчетаВзаиморасчетовПриИзменении(Элемент)
	УправлениеФормой(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицФормы

&НаКлиенте
Процедура ПозицииАктивПриИзменении(Элемент)

	Действия = ОбработкаТабличныхЧастейКлиентСерверУХ.ПолучитьДействияПозиций(Истина, Истина, Истина, Истина);
	Действия.Вставить("ПолучитьПараметрыУчета", Истина);
	
	Если КэшируемыеЗначения.КэшОперации.ЕстьДоли Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия,
			ОбработкаТабличныхЧастейКлиентСерверУХ.ПолучитьДействияИнвестиций(Истина, Ложь));	
	КонецЕсли;
		
	ОбработатьСтрокуТЧ(ЭтотОбъект, Элементы.Позиции.ТекущиеДанные, Действия);

КонецПроцедуры

&НаКлиенте
Процедура ПозицииПараметрыУчетаПриИзменении(Элемент)

	Действия = ОбработкаТабличныхЧастейКлиентСерверУХ.ПолучитьДействияПозиций(Истина, Истина, Ложь, Истина);
	ОбработатьСтрокуТЧ(ЭтотОбъект, Элементы.Позиции.ТекущиеДанные, Действия);

КонецПроцедуры

&НаКлиенте
Процедура ПозицииКоличествоПриИзменении(Элемент)

	Действия = ОбработкаТабличныхЧастейКлиентСерверУХ.ПолучитьДействияПозиций(Истина, Истина, Ложь, Ложь);
	ОбработатьСтрокуТЧ(ЭтотОбъект, Элементы.Позиции.ТекущиеДанные, Действия);

КонецПроцедуры

&НаКлиенте
Процедура ПозицииЦенаПриИзменении(Элемент)

	Действия = ОбработкаТабличныхЧастейКлиентСерверУХ.ПолучитьДействияПозиций(Истина, Истина, Ложь, Ложь);
	ОбработатьСтрокуТЧ(ЭтотОбъект, Элементы.Позиции.ТекущиеДанные, Действия);

КонецПроцедуры

&НаКлиенте
Процедура ПозицииСуммаПриИзменении(Элемент)

	Действия = ОбработкаТабличныхЧастейКлиентСерверУХ.ПолучитьДействияПозиций(Ложь, Истина, Ложь, Ложь);
	Действия.Вставить("ЗаполнитьЦену");
	ОбработатьСтрокуТЧ(ЭтотОбъект, Элементы.Позиции.ТекущиеДанные, Действия);

КонецПроцедуры

&НаКлиенте
Процедура ПозицииСтавкаНДСПриИзменении(Элемент)

	Действия = ОбработкаТабличныхЧастейКлиентСерверУХ.ПолучитьДействияПозиций(Ложь, Истина, Ложь, Ложь);
	ОбработатьСтрокуТЧ(ЭтотОбъект, Элементы.Позиции.ТекущиеДанные, Действия);

КонецПроцедуры

&НаКлиенте
Процедура ПозицииСуммаНДСПриИзменении(Элемент)

	Действия = ОбработкаТабличныхЧастейКлиентСерверУХ.ПолучитьДействияПозиций(Ложь, Ложь, Ложь, Ложь);
	ОбработатьСтрокуТЧ(ЭтотОбъект, Элементы.Позиции.ТекущиеДанные, Действия);

КонецПроцедуры

&НаКлиенте
Процедура ПозицииКоличествоДопПриИзменении(Элемент)

	Действия = ОбработкаТабличныхЧастейКлиентСерверУХ.ПолучитьДействияИнвестиций();
	ОбработатьСтрокуТЧ(ЭтотОбъект, Элементы.Позиции.ТекущиеДанные, Действия);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции_Общие

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Объект = Форма.Объект;
	
	МСФОКлиентСерверУХ.УправлениеФормой_ВидОперации(Форма);
	МСФОКлиентСерверУХ.УправлениеФормой_ЦеныИВалюта(Форма);
	МСФОКлиентСерверУХ.УправлениеФормой_ПараметрыУчета(Форма);
	МСФОКлиентСерверУХ.УправлениеФормой_СФ(Форма);
	МСФОКлиентСерверУХ.УправлениеФормой_Итоги(Форма, "Сумма", "Позиции");
			
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере(ТекущийОбъект = Неопределено)
	
	КэшируемыеЗначения = Новый Структура;

	Действия = "ЗаполнитьУП, ЗаполнитьСтрану, ЗаполнитьПОУ, ОбновитьКэшОперации";
	МСФОКлиентСерверУХ.ПриИзмененииРеквизита(ЭтотОбъект, Действия, Ложь);
	
	Действия = Новый Структура("ЗаполнитьСуммаСНДС");
	Если КэшируемыеЗначения.КэшОперации.ЕстьДоли Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Действия,
			ОбработкаТабличныхЧастейКлиентСерверУХ.ПолучитьДействияИнвестиций(Истина, Ложь));	
	КонецЕсли;
	
	Для каждого СтрокаТЧ Из Объект.Позиции Цикл
		ОбработатьСтрокуТЧ(ЭтотОбъект, СтрокаТЧ, Действия, Ложь);
	КонецЦикла;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.СчетФактураМСФО) Тогда
		МСФОКлиентСерверУХ.ЗаполнитьПоСчетФактуре(ЭтотОбъект);
	КонецЕсли;
	
	СчетФактура = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(КэшируемыеЗначения, "СчетФактура");
	МСФОУХ.ПрименитьПраваДоступаСчетаФактуры(
		СчетФактура,
		Элементы.СчетФактураПросмотр,
		Элементы.СчетФактураРедактирование);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОбработатьСтрокуТЧ(Форма, СтрокаТЧ, Действия, УправлениеФормой = Истина)
	
	ОбработкаТабличныхЧастейКлиентСерверУХ.ОбработатьСтрокуТЧА(СтрокаТЧ, Действия, Форма);
	
	Если УправлениеФормой Тогда
		УправлениеФормой(Форма);//пересчитать итог документа	
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ПриИзмененииРеквизита(Элемент)
	
	Действия = Неопределено;
	ДействияТЧ = Неопределено;
	
	Если Элемент.Имя = "Организация" Тогда		
		Действия = "ЗаполнитьУП, ЗаполнитьСтрану, ЗаполнитьДоговор";
		ДействияТЧ = ОбработкаТабличныхЧастейКлиентСерверУХ.ПолучитьДействияИнвестиций();
	ИначеЕсли Элемент.Имя = "ВидОперации" Тогда
		Действия = "ОбновитьКэшОперации";
		ДействияТЧ = ОбработкаТабличныхЧастейКлиентСерверУХ.ПолучитьДействияИнвестиций();
	ИначеЕсли Элемент.Имя = "Сценарий" Тогда
		Действия = "ЗаполнитьУП";
		ДействияТЧ = ОбработкаТабличныхЧастейКлиентСерверУХ.ПолучитьДействияИнвестиций();
	ИначеЕсли Элемент.Имя = "Дата" Тогда
		Действия = "ЗаполнитьУП";
		ДействияТЧ = ОбработкаТабличныхЧастейКлиентСерверУХ.ПолучитьДействияИнвестиций();
	ИначеЕсли Элемент.Имя = "Контрагент" Тогда
		Действия = "ЗаполнитьДоговор";
	ИначеЕсли Элемент.Имя = "ДоговорКонтрагента" Тогда
		Действия = "ЗаполнитьВалюту, ЗаполнитьТипЦен";
		ДействияТЧ = "ЗаполнитьЦены";
	ИначеЕсли Элемент.Имя = "ТипЦен" Тогда
		ДействияТЧ = "ЗаполнитьЦены";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Действия) Тогда
	    МСФОКлиентСерверУХ.ПриИзмененииРеквизита(ЭтотОбъект, Действия, Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДействияТЧ) Тогда
		Для каждого СтрокаТЧ Из Объект.Позиции Цикл
			ОбработатьСтрокуТЧ(ЭтотОбъект, СтрокаТЧ, ДействияТЧ, Ложь);
		КонецЦикла;
	КонецЕсли;

	УправлениеФормой(ЭтотОбъект);

КонецФункции

#КонецОбласти
